{
  "questions": [
    "Which of the following statement is true with reference to planning?",
    "What is known as primary function of management",
    "Which of the following is not a benefit of planning",
    "A strategy is a comprehensive plan which will not include this dimension",
    "________ provide the prescribed ways or manner in which a task has to be performed considering the objective",
    "________ take the course of forming the organization’s identity in the business environment.",
    "A strategy is derived from",
    "_______ is regarded as the cognitive process resulting in the selection of   a  belief or a course of action among several alternative possibilities.",
    "What are characteristics of a programmed decision",
    "________ forecasting techniques are subjective and are applied to long term decision.",
    "________ can be defined as formalized or systematic way of doing routine or repetitive jobs.",
    "Which of the following is a benefit of planning",
    "Which of the following is not true for forecasting",
    "Which of the following is not a forecasting technique",
    "Making decisions on the basis of experience, feelings and accumulated judgement is called as __________.",
    "Name the process which co-ordinates human efforts, assembles resources and integrates both into a unified whole to be utilized for achieving specified objectives",
    "Organizing is a process by which the manager",
    "It is defined as the framework within which managerial and operating tasks are performed.",
    "As the span of management increases in an organisation, the number of levels of management in the organisation",
    "Identify the type of organisational structure which facilitates occupational specialisation",
    "Under this type of organisational structure, manpower is grouped on the basis of different products manufactured.",
    "Which of the following is not a merit of divisional structure",
    "Which of the following is not a demerit of divisional structure",
    "Identify the correct sequence of steps to be followed in an organising process",
    "Which of the following is not a demerit of functional structure",
    "Which of the following is not a feature of formal organisation",
    "Which of the following is not a merit of formal organisation",
    "Which of the following is not a feature of informal organisation",
    "Which of the following is not an element of delegation",
    "The scope of authority _________ as we go higher up in the management hierarchy.",
    "When a manager monitors the work performance of workers in his department to determine if the quality of their work is ‘up to standard’, this manager is engaging in which function",
    "What is the first step in a control process",
    "What are the main characteristics of an effective control system",
    "Which of the following is a feature of controlling",
    "A company had to increase salary of its employees due to a government policy. So this affected budget and production of company in a negative aspect.’ Which limitation of controlling best describes above scenario",
    "What can be said about planning and controlling",
    "Assembling of facilities and personnel for collecting, processing, information that is required by managers is called",
    "Who created the Plan-Do-Check-Act Cycle",
    "Management audit is a technique to keep a check on the performance of ",
    "Controlling is needed at which level of management",
    "Strike is which type of cause of deviation",
    "Which management function involves measuring results, comparing results to expectations, and taking corrective action",
    "The following is are the elements of control",
    "Which of the following is not a process of controlling",
    "Which is the example of vertical internal coordination",
    "What is the role of Public Relation Officers(PRO)",
    "Identify which of the following statement is correct  and which is incorrect ?\u2028X. Co-ordination should be viewed as a responsibility of only top level manager of the organization.\u2028Y. Co-ordination and co-operation are same things.\u2028Select the correct answer from the options given below",
    "What are the reasons behind the importance of coordination in management",
    "Which of the following is type of coordination",
    "What brings unity of action and integrates different activities of organization",
    "Co-ordination is required at which level",
    "……… is rightly called the ' Essence of management'",
    "Successful coordination of activities results from effectively carrying out the function:",
    "Which among the following is not an element of coordination",
    "The process of organising consist of……….",
    "………. is a function of management which refers to the process of integrating the activities of different units of organisation to achieve the organisation goals. This is called",
    "When management pays attention to more important areas and when the day to day routine problems are looked after by lower level management, it is known as",
    " ............... denotes concentration of authority at the top level",
    " ............... is the technique in which each worker is supervised by eight supervisors",
    "Guiding and supervising the efforts of subordinates towards the attainment of the organization 's goals describes the function of:",
    "Directing function of management embraces activities of:",
    "Adequate motivation of employees results in",
    "Directing is initiated at the ________ level.",
    " Directing is a responsibility of ________ at all levels.",
    "A function directly related to human beings:",
    "According to the Five Factor model, 'extraversion' as a personality type is characterised by what type of people",
    "What does situational theory of leadership emphasise",
    "What do you call a style of leadership that takes account of others' views, opinions and ideas",
    "what are the key characteristics of transactional leaders",
    "What is the term for power derived from status or position in an organisation",
    "What are workers primarily motivated by according to the instrumental approach",
    "Which of the following motivators is the most basic need in Maslow's hierarchy",
    "What theory is built around the principle that 'people make choices regarding how to behave based on values and beliefs'",
    "How does lateral communication in an organisation occur",
    "Successful organisations do not achieve goals by chance but by following a deliberate process known as ",
    "The purpose of staffing is ",
    "Which of the following statements is not true for staffing",
    "This function of Management related to placing the right person at the right job is",
    "Staffing include",
    "The process of acquiring, deploying, and retaining a workforce of sufficient quantity and quality to create positive impacts on the organization's effectiveness is called _________.",
    "Which of the following statements is true regarding staffing",
    "The staffing practice in which an organization does selective hiring during\u2028downturns or recessions that occur prior to a clear upturn in economic strategy is called ___________.",
    "According to the staffing quantity model, an organization will be __________ when availabilities exceed requirements.",
    "The staffing quantity model uses _________ to determine whether a condition of being overstaffed, fully staffed, or understaffed exists.",
    "Which of the following is not concerned with staffing",
    "_________ involves planning, acquisition & development of resources necessary for organizational success.",
    "Which of the following is not a process of selection",
    "______ refers to careful study of each of each job to determine tasks & responsibility involved in a job.",
    "The most common causes of financial problems are",
    "The steps in financial planning are:",
    "Which forecast gives management some sense of the profit potential possible of different strategic plans",
    "A statement that projects management's expectations for revenues and, based on those financial expectations, allocates the use of specific resources throughout the firm is called:",
    "A(n) budget is the plan of the various costs and expenses needed to operate the business, based on the short-term forecast",
    "Debt capital refers to",
    "The most widely used source of short-term funding is:",
    "A loan backed by collateral is called a:",
    "Which of the following is a short-term source of funds",
    "A short-term corporate equivalent of an IOU that is sold in the market place by a firm is called:",
    "A bond backed by the company's real assets is called a",
    "A firm's profit that is distributed to shareholders is called:",
    "The type of corporate ownership stock that gives owners preference over common shareholders in the payment of dividends and in a claim on assets if the company is liquidated is called:",
    "Which of the following is not an advantage of issuing bonds",
    "An example of a blue chip stock is",
    "Financial management is concerned with managerial activities relating to",
    "Which of the following factors affect financial decision",
    "Which of the factors affect dividend decisions",
    "Financial management process deals with",
    "Financial management mainly focuses on",
    "Investment decision involves",
    "Current liabilities include",
    "P&L statement is also known as",
    "On balance sheet, accruals, notes payables, and account payable are listed under which category",
    "Dividends are paid",
    "Net working capital refers to",
    "Which of the following is not a feature of a financial plan",
    "The long-run objective of financial management is to",
    "The market price of a share of common stock is determined by",
    "Mass production is characterized by",
    "The production scheduling is simpler and high volume of output and high labour efficiency are achieved in the case of",
    "The disadvantage of product layout is",
    "The process layout is best suited where",
    "Production cost refers to prime cost plus",
    "Process layout is employed",
    "Product layout is used for",
    "Process layout is also known as",
    "Process layout is employed for",
    "Travel charts are used to",
    "The following type of layout is preferred to manufacture a standard product in large quantity",
    "This chart is a graphic representation of all the production activities occurring on the shop floor",
    "“Most effective utilisation of available space in horizontal and vertical directions” is known as principle of-",
    "Which of the following does not cause any production delay",
    "Which of the following industries consider humid climate as a positive factor",
    "which of the following is not an advantage of using product layout",
    "In which of the following layouts, the lines need to be balanced",
    "The process involved in recruiting, hiring, training, evaluating, compensating and laying off people is called as ",
    "Which is not a step in the selection process",
    "Which of these is not a part of human resource policy",
    "What is the purpose of employee relations",
    "A systematic way of determining the value/worth of a job in relation to other jobs in an organisation is-",
    "All of the following are sources of internal recruiting except-",
    "What is the human factor",
    "Job Analysis is a systematic procedure for securing and reporting information defining a",
    "Which of the following factors state the importance of the Human Resource Planning",
    "The process of grouping of similar types of works together is known as",
    "The first step in the human resource planning process is",
    "Recruitment is a _______ process",
    "What are the ideas underpinning 'soft', 'commitment', or 'high-road' HRM practices",
    "Why are employers interested in employee engagement",
    "What does the term 'financialization' refer to",
    "What measures are typically involved in the rationalizing of businesses",
    "What kinds of practices outlined below are typically associated with non-standard working and flexibility",
    "The goal of producing 'the greatest good for the greatest number' is an idea from what school of ethics",
    "A common way of determining a fair reward might be one based on..",
    "Why does the shareholder value perspective argue that it makes good sense from a business point of view not to discriminate between individuals",
    "Why might equal opportunity be hard to export to some countries",
    "A job _______ is a summary of the objectives of the job, the type of work to be done, the responsibilities and duties, the working condition and the relationships of the job to other functions.",
    "Which of the following is a written summary of the minimum qualifications required of a worker to fill a specific job",
    "Which function is not included in training and development programs",
    "Which of the following is not an employee benefit",
    "A work schedule that gives employees some freedom to adjust when they work is called:",
    " ________ is defined as the record of outcomes produced on a specific job function or activity during a specific time period.",
    "HR professionals should apply risk management techniques to the different aspects of _______ ",
    "The following techniques is based on the critical incident approach",
    "The organizations ____ must be conducive to productivity and quality improvement.",
    "What is the term for a radical rethinking of the nature of the business",
    "Which one is not part of Lewin's (1952) three step approach to change",
    "Which one is not an element in the primary activities of a value chain",
    "What does PEST stand for",
    "Profitability stemming from how well a firm positions itself in the market is a key feature of which writer's view on strategy",
    "In the 'five forces model', what is the type of competitive activity that exists between organisations",
    "What is the term for the action in which managers at an organisation analyse the current situation of their organisation and then develop plans to accomplish its mission and achieve its goals",
    "Hygiene factors are associated with which writer",
    "The term used to describe humans’ desire for life-sustaining supports such as food and water is:",
    "Which of the following motivators is the most basic need in Maslow's hierarchy",
    "What are workers primarily motivated by according to the instrumental approach",
    "Many companies link compensation to performance. An incentive plan that intentionally pays good performers more money than poor performers is",
    "Making a job more motivating and satisfying by adding variety and responsibility is referred to as",
    "______________ refers to a person’s beliefs about the extent to which an activity can satisfy his or her needs for competence and self-determination",
    "The motivational process by which a manager shares power with his or her team members, thereby enhancing their feelings of self-efficacy is called",
    "The two-factor theory has made lasting contributions to work motivation by",
    "According to Herzberg, pay, status, job security, working conditions, and quality of leadership are _______________ factors while achievement, recognition, advancement, responsibility, the work itself, and personal growth possibilities are ___________ factors",
    "Herzberg’s two-factor theory of work motivation",
    "Maslow was a ____________",
    "How many levels are there on Maslow's hierarchy",
    "How is Maslow's hierarchy most often displayed",
    "Breathing, food, water, and sleep are all part of this level of needs",
    "Not all will achieve all needs",
    "____________ is up an example of a safety need",
    "When parents say \"you will never be good enough to go to college\"  they are not helping their child achieve",
    "If safety needs are not met one cannot move to",
    "Assumption of Douglas McGregor’s assumption, people based on which theory are more involved in decision making",
    "According to assumption of Douglas McGregor’s assumption about people based on theory Y, people view their work as",
    "According to Mayo’s Hawthorne experiments, employer can be motivated by satisfying",
    "which of the following is assumption of Douglas McGregor’s assumption about people based on theory Y",
    "which of the following is not assumption of Douglas McGregor’s assumption about people based on theory x",
    "Which of the following are possible indicators of a manager’s effectiveness",
    "What is the Hawthorne Effect",
    "In order to manage time effectively, managers should have clear objectives, forward plan carefully, define priorities and actions and",
    "Elton Mayo conducted his Hawthorne experiment in ",
    "Which of the following statements is not an assumption of a manager who might adopt a Theory X style of management",
    "There are two aspects of human behaviour at work, one of which negative called",
    "What management theory states that employees are inherently motivated and should be left to complete their work without supervision",
    "Theory X deals with _________kind of leadership",
    "Which character belong to Theory Y employee",
    "Who proposed theory ''x'' and theory ''y'' to be recognized as motivational theories in developing managerial leadership:",
    "Functional type of organization was first developed by",
    "The Fayol’s principle that the subordinate should have single boss is",
    "Which of the following does not follow Division of Work principle",
    "Which of the following is TRUE",
    "What is Esprit de corpse principle",
    "Remuneration Principle:",
    "Source of motivation for workers based on Principle of scientific management",
    "Identify the CORRECT statement",
    "Which one of the following is not one of Fayol’s principle",
    "Who is the founding father of scientific management theory",
    "Taylor believed that increased efficiency could be achieved by",
    "What is the guiding principle of scientific management",
    "What is a social enterprise concerned with",
    "Who of these is the entrepreneur",
    "Which of these is not part of the recognised challenges for modern managers",
    "Which one is not a recognised key skill of management",
    "What is the guiding principle behind New Public Management",
    "At what level of an organisation does a corporate manager operate",
    "What are the three interpersonal roles of managers",
    "Which one of the following is not one of Drucker's five guiding principles of management",
    "Who of the following is the industrial philanthropist",
    "In what order do managers typically perform the managerial functions",
    "The application of the principles of management has to be changed as per the requirements of the prevailing situation at a particular point of time. Which feature of the principles of management is being described in the given statement",
    "The principles of management enhance the understanding of relationship between human and material resources for the achievement of organisational goals. Identify the feature of the principles of management being described in the given statement",
    "Principles of management can be modified by the manager when the situation demands. This statement implies that the principles of management are",
    "The principles of management do not provide readymade straight jacket solutions to all management problems because",
    "The principles of management are intended to be applied to all types and sizes of organisations. This statement reflects that the principles of management are",
    "Which of the following statements is/are true with reference to principles of management",
    "The principles of management have been developed on the basis of",
    "Which of the following statements best defines the techniques of management",
    "The principles of pure science is considered to be _________ in nature",
    "Which of the following statements is true with reference to principles of management",
    "Quantitative approach is concerned with______",
    "Which approach is based on the belief that personal attitudes and group behaviour are influenced by the technical system in which people work",
    "Which of the following approach analyses the management by studying the case histories of successful managers",
    "Management is considered important because______",
    "Which of the following is not an objective of management",
    "Management and administration are",
    "To manage is to forecast and plan, to organize, to compound, to co-ordinate and to control. This definition was given by",
    "Who does define the management is the art of getting things done through people",
    "Frederick W. Taylor is associated with",
    "In what order do managers typically perform the managerial functions",
    "Which of the following is not a management approach",
    "Supply chains are managed via",
    "Which of the following principle is not included in Fayol’s principles of management",
    "Select the order from low to high in Maslow’s Hierarchy needs",
    "Hygiene Facor work condition related to",
    "Management is a/an ______ activity",
    "According to Mayo’s Hawthorne experiments, Productivity is linked with______ satisfaction in any business organization",
    "Management is individual activity.",
    "The Decisional Role not includes",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ]
}
